namespace ASP_32.Models.Rest
{
    public class RestResponce
    {
        public RestStatus Status { get; set; } = new();
        public RestMeta Meta { get; set; } = new();

        public Object? Data { get; set; }
    }
}

/*
 * Набір архітектурних вимог/принципів, реалізація яких покращує роботу розподілених систем.
 * 
 * API (Application Program Interface) - інтрейфес взаємодії Програми зі своїми Застосунками 
 * у цьому контексті Програма - інформаційний центр, зазвичай бекенд
 * ЗАстосунок - самостійна частина, зазвичай клієнтського призначення, яка взаємодіє з Програмаю, шляхом обміну даними.
 * (* також Додаток - несамостійна програма - плагін або розширення *)
 */